Revit 2024 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceIgnoresSplitters Property
 Revit cannot create a rectangular grid by intersecting the current selection of elements (levels, reference planes, or curves drawn on reference planes) with the surface. Make sure that curves do not form closed loops. It is helpful if curves start and end outside the surface, rather than inside it.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DividedSurfaceIgnoresSplitters { get; }
Visual Basic
Public Shared ReadOnly Property DividedSurfaceIgnoresSplitters As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DividedSurfaceIgnoresSplitters {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace